In [1]:
#인자가 없는 형태
def my_func():
    print("My first fun!")
    print("My first fun!")

In [2]:
my_func()

My first fun!
My first fun!

In [13]:
#인자는 있지만 반환 값이 없는 형태
def my_friend(name):
    print("{}는 나의 친구".format(name[0]))

In [15]:
list=['홍길동','29세']
my_friend(list)

홍길동는 나의 친구

In [11]:
def my_info(name,id,number):
    print(" 이름 = ",name)
    print(" id = ",id)
    print(" number = ",number)

In [12]:
my_info('길동',123,'010-353')

 이름 =  길동
 id =  123
 number =  010-353

In [16]:
##인자도 있고 반환 값도 있는 함수
##가장 많이 사용되는 형태

def my_calc(x,y):
    z=x*y
    return z

In [17]:
my_calc(2,5)

10

In [18]:
def sum(a,b):
    return a+b

In [19]:
a=3
b=2
sum(3,2)

5

In [26]:
def sum_many(*numbers): ### *를 붙이면 모두 모이튜플로 만들어준다. --> 즉, 인수 여러개를 입력할 수 있음. sum(a,b)의 경우 인수 2개만 가능
    sum=0
    for i in numbers:
        sum = sum + i
    return sum

In [28]:
sum_many(1,6,2,16)

25

In [6]:
from pandas import Series,DataFrame  ### pandas 안에 여러 기능이 있는데 Series와 DataFrame만 불러온다.
import pandas as pd  #### pandas를 pd로 줄여서 부른다.


fruit=Series([2500,3800,1200,6000],['apple','banana','peer','cheery'])
print(fruit)

apple     2500
banana    3800
peer      1200
cheery    6000
dtype: int64

In [7]:
fruit=Series([2500,3800,1200,6000],['apple','banana','peer','cheery'])
print(fruit.values)
print(fruit.index)

[2500 3800 1200 6000]
Index(['apple', 'banana', 'peer', 'cheery'], dtype='object')

In [10]:
fruitData={'apple':2500,'banana':3800,'peer':1200,'cherry':6000}
fruit=Series(fruitData)
print(fruit)
print()
print(type(fruitData))

print(type(fruit))

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

<class 'dict'>
<class 'pandas.core.series.Series'>

In [11]:
fruit=Series([2500,3800,1200,6000],['apple','banana','peer','cheery'])
fruit.name='fruitPrice'  ###Series 자체의 이름. 
fruit.index.name='fruitName' ####index의 이름. index 위에 위치함.
print(fruit)

fruitName
apple     2500
banana    3800
peer      1200
cheery    6000
Name: fruitPrice, dtype: int64

In [13]:
fruitData={'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500,3800,6000,1200],'num':[10,5,3,8]}
fruitFrame=DataFrame(fruitData)
print(fruitFrame)

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [18]:
fruitData={'fruitName':['apple','banana','cherry','peer'],
           'fruitPrice':[2500,3800,6000,1200],
           'num':[10,5,3,8]}
fruitFrame=DataFrame(fruitData,columns = ['fruitPrice','num','fruitName'])
print(fruitFrame)

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      peer

In [24]:
fruitFrame['fruitName'] #### == fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [25]:
fruitData={'fruitName':['apple','banana','cherry','peer'],
           'fruitPrice':[2500,3800,6000,1200],
           'num':[10,5,3,8]}
fruitFrame=DataFrame(fruitData,columns=['fruitName','num','fruitPrice'])
fruitFrame

  fruitName  num  fruitPrice
0     apple   10        2500
1    banana    5        3800
2    cherry    3        6000
3      peer    8        1200

In [45]:
a=fruitFrame['num']
print(a)
print()
fruitFrame['year']=2016
print(fruitFrame)

apple     10
banana     5
cherry     3
peer       8
Name: num, dtype: int64

        fruitPrice  num  year
apple         2500   10  2016
banana        3800    5  2016
cherry        6000    3  2016
peer          1200    8  2016

In [30]:
variable=Series([4,2,1],index=[0,2,3])
fruitFrame['stock']=variable
fruitFrame

  fruitName  num  fruitPrice  year  stock
0     apple   10        2500  2016    4.0
1    banana    5        3800  2016    NaN
2    cherry    3        6000  2016    2.0
3      peer    8        1200  2016    1.0

In [32]:
fruit=Series([2500,3800,1200,6000],index=['apple','banana','cherry','peer'])
new_fruit=fruit.drop('banana')
print(fruit)
print()
print(new_fruit)

apple     2500
banana    3800
cherry    1200
peer      6000
dtype: int64

apple     2500
cherry    1200
peer      6000
dtype: int64

In [83]:
fruitData={'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500,3800,6000,1200],'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame=DataFrame(fruitData,index=fruitName,columns=['fruitPrice','num']) ### fruitName이 index로 넘어갔기때문에 column은 3개가 아닌 3개
fruitFrame2=fruitFrame.drop(['apple','cherry'])
print(fruitFrame)
print()
print(fruitFrame2)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

        fruitPrice  num
banana        3800    5
peer          1200    8

In [135]:
fruitData={'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500,3800,6000,1200],'num':[10,5,3,8]}
fruitFrame=DataFrame(fruitData,index=fruitData['fruitName'],columns=['fruitPrice','num'])
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [149]:
fruitFrame2=fruitFrame.drop(['cherry','apple'])
fruitFrame2

        fruitPrice  num
banana        3800    5
peer          1200    8

In [153]:
fruitFrame.drop('num',axis=1,inplace=False) ####axis에서 0==index, 1==columns를 의미함. 그러므로 axis=1이어야 num을 columns에서 찾을 수 있음
####inplace: 앞의 명령을 직접 적용하시오.

        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [152]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [89]:
fruit=Series([2500,3800,1200,6000],index=['apple','banana','peer','cherry'])
fruit['apple':'peer']

apple     2500
banana    3800
peer      1200
dtype: int64

In [97]:
fruitData={'fruitName':['apple','banana','cherry','peer'], 'fruitPrice':[2500,3800,6000,1200],'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame=DataFrame(fruitData,index=fruitName,columns=['fruitPrice','num'])
print(fruitFrame)
print()
print(fruitFrame['fruitPrice'])
print()
print(fruitFrame['apple':'banana'])

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64

        fruitPrice  num
apple         2500   10
banana        3800    5

In [113]:
fruitData={'fruitName':['apple','banana','cherry','peer'], 'fruitPrice':[2500,3800,6000,1200],'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame=DataFrame(fruitData,columns=['fruitPrice','num'])
fruitFrame

   fruitPrice  num
0        2500   10
1        3800    5
2        6000    3
3        1200    8

In [119]:
fruitData={'fruitName':['apple','banana','cherry','peer'], 'fruitPrice':[2500,3800,6000,1200],'num':[10,5,3,8]}
fruitFrame=DataFrame(fruitData,columns=['fruitPrice','fruitName','num'])
fruitFrame2=fruitFrame.drop('fruitName',axis=1)
fruitFrame2['fruitName2']=['orange','mango','kiwi','grape']
fruitFrame2

   fruitPrice  num fruitName2
0        2500   10     orange
1        3800    5      mango
2        6000    3       kiwi
3        1200    8      grape

In [155]:
fruit1=Series([5,9,10,3],index=['apple','banana','cherry','peer'])
fruit2=Series([3,2,9,5,10],index=['apple','orange','banana','cherry','mango'])
print(fruit1)
print()
print(fruit2)
print()
fruit1+fruit2

apple      5
banana     9
cherry    10
peer       3
dtype: int64

apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [160]:
fruitData1={'Ohio':[4,8,3,5],'Texas':[0,1,2,3]}
fruitFrame1=DataFrame(fruitData1,columns=['Ohio','Texas'],index=['apple','banana','cherry','peer'])
fruitData2={'Ohio':[3,0,2,1,7],'Colorado':[5,4,3,6,0]}
fruitFrame2=DataFrame(fruitData2,columns=['Ohio','Colorado'],index=['apple','orange','banana','cherry','mango'])
print(fruitFrame1)
print('-'*40)
print(fruitFrame2)
print('-'*40)
print(fruitFrame1+fruitFrame2)

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3
----------------------------------------
        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0
----------------------------------------
        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

In [163]:
fruit=Series([2500,3800,1200,6000],index=['apple','banana','cherry','peer'])
fruit.sort_values(ascending=True)

cherry    1200
apple     2500
banana    3800
peer      6000
dtype: int64

In [171]:
fruitData={'fruitName':['peer','banana','apple','cherry'], 'fruitPrice':[2500,3800,6000,1200],'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame=DataFrame(fruitData,index=fruitName,columns=['num','fruitPrice'])

print(fruitFrame)
fruitFrame.sort_index(axis=0)

        num  fruitPrice
peer     10        2500
banana    5        3800
apple     3        6000
cherry    8        1200

        num  fruitPrice
apple     3        6000
banana    5        3800
cherry    8        1200
peer     10        2500

In [172]:
fruitFrame.sort_index(axis=1)

        fruitPrice  num
peer          2500   10
banana        3800    5
apple         6000    3
cherry        1200    8

In [175]:
fruitFrame.sort_values(by=['num'],ascending=False)

        num  fruitPrice
peer     10        2500
cherry    8        1200
banana    5        3800
apple     3        6000

In [180]:
german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv")
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [186]:
german.head(7) ### 앞 5개만 보여주세요

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
0,1,1,18,4,2,1049,1,2,4,2,...,4,2,21,3,1,1,3,1,1,1
1,1,1,9,4,0,2799,1,3,2,3,...,2,1,36,3,1,2,3,2,1,1
2,1,2,12,2,9,841,2,4,2,2,...,4,1,23,3,1,1,2,1,1,1
3,1,1,12,4,0,2122,1,3,3,3,...,2,1,39,3,1,2,2,2,1,2
4,1,1,12,4,0,2171,1,3,4,3,...,4,2,38,1,2,2,2,1,1,2
5,1,1,10,4,0,2241,1,2,1,3,...,3,1,48,3,1,2,2,2,1,2
6,1,1,8,4,0,3398,1,4,1,3,...,4,1,39,3,2,2,2,1,1,2

In [183]:
german.shape ### 데이터 갯수

(1000, 21)

In [185]:
german.info() ## 데이터 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Creditability                      1000 non-null   int64
 1   Account Balance                    1000 non-null   int64
 2   Duration of Credit (month)         1000 non-null   int64
 3   Payment Status of Previous Credit  1000 non-null   int64
 4   Purpose                            1000 non-null   int64
 5   Credit Amount                      1000 non-null   int64
 6   Value Savings/Stocks               1000 non-null   int64
 7   Length of current employment       1000 non-null   int64
 8   Instalment per cent                1000 non-null   int64
 9   Sex & Marital Status               1000 non-null   int64
 10  Guarantors                         1000 non-null   int64
 11  Duration in Current address        1000 non-null   int64
 12  Most valuable available asset      1000 non-null   int64
 13  Age (years)                        1000 non-null   int64
 14  Concurrent Credits                 1000 non-null   int64
 15  Type of apartment                  1000 non-null   int64
 16  No of Credits at this Bank         1000 non-null   int64
 17  Occupation                         1000 non-null   int64
 18  No of dependents                   1000 non-null   int64
 19  Telephone                          1000 non-null   int64
 20  Foreign Worker                     1000 non-null   int64
dtypes: int64(21)
memory usage: 164.2 KB

In [187]:
german.tail(3)

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
997,0,4,21,4,0,12680,5,5,4,3,...,4,4,30,3,3,1,4,1,2,1
998,0,2,12,2,3,6468,5,1,2,3,...,1,4,52,3,2,1,4,1,2,1
999,0,1,30,2,2,6350,5,5,4,3,...,4,2,31,3,2,1,3,1,1,1

In [198]:
##select_column=['Creditability','Duration of Credit (month)','Purpose','Credit Amount']
##german_sample=german[select_column]
german_sample=german[['Creditability','Duration of Credit (month)','Purpose','Credit Amount']] ## 대괄호 2개
german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [199]:
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [200]:
german_sample.mean()  #평균

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [201]:
german_sample.describe()

       Creditability  Duration of Credit (month)      Purpose  Credit Amount
count    1000.000000                 1000.000000  1000.000000     1000.00000
mean        0.700000                   20.903000     2.828000     3271.24800
std         0.458487                   12.058814     2.744439     2822.75176
min         0.000000                    4.000000     0.000000      250.00000
25%         0.000000                   12.000000     1.000000     1365.50000
50%         1.000000                   18.000000     2.000000     2319.50000
75%         1.000000                   24.000000     3.000000     3972.25000
max         1.000000                   72.000000    10.000000    18424.00000

In [204]:
german=pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')
german_sample=german[['Duration of Credit (month)','Credit Amount','Age (years)']]

german_sample.corr()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [203]:
german_sample.cov()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),145.415006,2.127401e+04,-5.140567
Credit Amount,21274.007063,7.967927e+06,1034.202787
Age (years),-5.140567,1.034203e+03,128.883119

In [211]:
german_sample=german[['Credit Amount','Type of apartment','Purpose']]
german_grouped=german_sample['Credit Amount'].groupby(german_sample['Type of apartment'])
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

In [215]:
german_grouped2=german_sample['Credit Amount'].groupby([german_sample['Purpose'],german_sample['Type of apartment']])
german_grouped2.mean()

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64

In [221]:
german=pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')
german_sample=german[['Type of apartment', 'Sex & Marital Status', 'Credit Amount']]
for type, group in german_sample.groupby('Type of apartment'):
    print(type)   
    print(group.head(3))
    print('-'*60)

1
   Type of apartment  Sex & Marital Status  Credit Amount
0                  1                     2           1049
1                  1                     3           2799
2                  1                     2            841
------------------------------------------------------------
2
   Type of apartment  Sex & Marital Status  Credit Amount
4                  2                     3           2171
6                  2                     3           3398
7                  2                     3           1361
------------------------------------------------------------
3
    Type of apartment  Sex & Marital Status  Credit Amount
29                  3                     3           4796
44                  3                     3           1239
69                  3                     3           2032
------------------------------------------------------------

In [226]:
for (type,sex),group in german_sample.groupby(['Type of apartment','Sex & Marital Status']):
    print((type,sex))
    print(group.head(3))
    print('-'*60)

(1, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
369                  1                     1           3021
777                  1                     1           3384
797                  1                     1           2319
------------------------------------------------------------
(1, 2)
   Type of apartment  Sex & Marital Status  Credit Amount
0                  1                     2           1049
2                  1                     2            841
9                  1                     2           3758
------------------------------------------------------------
(1, 3)
   Type of apartment  Sex & Marital Status  Credit Amount
1                  1                     3           2799
3                  1                     3           2122
5                  1                     3           2241
------------------------------------------------------------
(1, 4)
    Type of apartment  Sex & Marital Status  Credit Amount
11                  1                     4           6187
14                  1                     4           1936
17                  1                     4           3213
------------------------------------------------------------
(2, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
50                   2                     1            640
97                   2                     1           4455
112                  2                     1           2366
------------------------------------------------------------
(2, 2)
    Type of apartment  Sex & Marital Status  Credit Amount
8                   2                     2           1098
12                  2                     2           1957
33                  2                     2           1376
------------------------------------------------------------
(2, 3)
   Type of apartment  Sex & Marital Status  Credit Amount
4                  2                     3           2171
6                  2                     3           3398
7                  2                     3           1361
------------------------------------------------------------
(2, 4)
    Type of apartment  Sex & Marital Status  Credit Amount
48                  2                     4           1474
57                  2                     4           1053
78                  2                     4           1602
------------------------------------------------------------
(3, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
620                  3                     1           9277
749                  3                     1           2892
784                  3                     1           2149
------------------------------------------------------------
(3, 2)
     Type of apartment  Sex & Marital Status  Credit Amount
423                  3                     2           2133
453                  3                     2           5743
467                  3                     2           5324
------------------------------------------------------------
(3, 3)
    Type of apartment  Sex & Marital Status  Credit Amount
29                  3                     3           4796
44                  3                     3           1239
69                  3                     3           2032
------------------------------------------------------------
(3, 4)
     Type of apartment  Sex & Marital Status  Credit Amount
125                  3                     4           5103
------------------------------------------------------------